<?php

use Illuminate\Database\Seeder;
use App\Industry;
use App\Occupation;

class IndustryTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
     //出展→https://ten-navi.com/hacks/article-272-25284
    public function run()
    {
        $industries=["管理的職","営業・企画職","事務・アシスタント・製造業職",
        "販売・サービス職","専門職(医療福祉系)","専門職(教育系)",
        "専門職(経営・金融・保険系)","技術職(電気・電子・機械)","技術職(素材・食品)",
        "技術職(クリエイター系・ソフトウェア・ネットワーク)","技術職(クリエイター系・ソフトウェア・ネットワーク以外)",
        "保安職","農林漁業職","生産工程職","建築・採掘職","運搬・清掃・包装等職"];
        $occupations=[["管理的公務員","法人・団体役員","法人・団体管理職","その他の管理的職",]
        ,["営業（代理店含む）","渉外","MR","企画","広告宣伝","販売促進","PR","MD","マーケティング",
        "商品企画","広告宣伝","広報","人事","財務","総務",],
        ["一般事務","会計事務","経理事務","生産関連事務","営業販売事務","外務事務","運輸・郵便事務",
        "事務用機器操作","秘書","受付","購買","物流","事務アシスタント",],
        ["店長","販売","接客","売り場担当","小売、外食","ホールスタッフ","フロアスタッフ","調理スタッフ",
        "美容関連（理美容・エステ・マッサージ・美容部員）","エステティシャン","マッサージ","旅行手配員",
        "添乗員","ツアーコンダクター","宿泊施設","ホテル","フロント業務","ブライダル関連","運輸","物流サービス",
        "配送","倉庫関連警備","清掃","監視","保守","カスタマーサポート","コールセンター","ユーザーサポート",
        "オペレータ",],
        ["医師","歯科医師","獣医師","薬剤師","保健師","助産師","看護師","医療技術者","その他の保健医療",
        "社会福祉専門職",],
        ["小中高等学校教員","大学教員","幼稚園教員","高等専門学校教員","その他の教員"],
        ["ビジネスコンサルタント","専門コンサルタント","金融関係","不動産","プロパティマネジメント",
        "保険関係",],
        ["基礎研究","先行開発","要素技術開発","回路・システム設計","半導体設計、機械設計","金型設計",
        "品質管理","品質保証","製品評価","生産管理","生産技術","プロセス開発","セールスエンジニア",
        "アプリケーションエンジニア","FAE","サービスエンジニア","光学技術","その他技術職","CADオペレーター",
        "評価","実験","研究","特許","デバイス開発","プロセスエンジニア","プロセスインテグレーション",
        "整備士","テクニカルマーケティング","テクニカルライター",],
        ["素材","半導体素材","化成品","化粧品","食品","香料",],
        ["コンサルタント","アナリスト","プリセールス","エンジニア","プログラマ","システム開発","アーキテクト",
         "パッケージ導入","システム導入","ネットワーク設計・構築","通信インフラ設計・構築","運用","監視",
         "テクニカルサポート","保守","社内SE","ヘルプデスク",],
        ["著述家","記者","編集者","美術家","デザイナー","写真集家","映像撮影者","音楽家","舞台芸術家",
        "翻訳家","その他の専門職従事者",],
        ["自衛官","司法警察","消防官","その他の保安職",],
        ["農業","林業","漁業",],
        ["生産設備制御・監視従事者(金属製品）","生産設備制御・監視従事者(金属製品を除く）",
        "機会組立設備制御・監視、製品製造・加工処理(金属製品）","製品製造・加工処理(金属製品を除く）",
        "機械組立","機械整備・修理、製品検査(金属製品）",
        "製品検査(金属製品を除く）","機械検査、生産関連・生産類似業",],
        ["建設解体工事","建設（建設解体工事を除く）","電気工事","土木作業","採掘",],
        ["運搬","清掃","包装","その他の運搬・清掃・包装等の職",],];

        foreach($industries as $index=>$industry)
        {
            
            $create_industry=Industry::create(["name"=>$industry]);
            foreach($occupations[$index] as $occupation)
            {
                Occupation::create([
                    'industry_id'=>$create_industry->id,
                    "name"=>$occupation]);
            }
           /* 
           $ind['created_at']=$now;
            $ind['updated_at']=$now;
            DB::table('industries')->insert($ind);
            */
        }
        
      /*  foreach($occupations as $oc)
        {
            $occupation=Occupation::create(["name"=>$oc]);
        }*/
    }
}
