<?php

use Illuminate\Database\Seeder;

class IndustryTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
     //出展→https://ten-navi.com/hacks/article-272-25284
    public function run()
    {
        $Industries=[["農業","林業","漁業（水産養殖業を除く)","水産養殖業",],
        ["鉱業","採石業"，"砂利採取業"],
        ["総合工事業","職別工事業(設備工事業を除く)","設備工事業"],
        ["食料品製造業","飲料","たばこ","飼料製造業","繊維工業","木材・木製品製造業（家具を除く）",
        "家具・装備品製造業","パルプ・紙・紙加工品製造業","印刷・同関連業","化学工業","石油製品・石炭製品製造業",
        "プラスチック製品製造業（別掲を除く)","ゴム製品製造業","なめし革・同製品・毛皮製造業","窯業・土石製品製造業",
        "鉄鋼業、非鉄金属製造業","金属製品製造業","はん用機械器具製造業","生産用機械器具製造業","業務用機械器具製造業",
        "電子部品・デバイス・電子回路製造業","電気機械器具製造業","情報通信機械器具製造業","輸送用機械器具製造業","その他製造業"],
        ["電気業","ガス業","熱供給業","水道業"],
        ["情報通信業：通信業","放送業","情報サービス業","インターネット附随サービス業","映像・音声・文字情報制作業"],
        ["鉄道業","道路旅客運送業","道路貨物運送業","水運業","航空運輸業","倉庫業","運輸に附帯するサービス業","郵便業（信書便事業を含む）"],
        ["各種商品卸売業","繊維・衣服等卸売業","飲食料品卸売業","建築材料・鉱物・金属材料等卸売業","機械器具卸売業","その他の卸売業","各種商品小売業",
        "織物・衣服・身の回り品小売業","飲食料品小売業","機械器具小売業","その他の小売業、無店舗小売業"],
        ["銀行業","協同組織金融業","貸金業","クレジットカード業等非預金信用機関","金融商品取引業","商品先物取引業",
        "補助的金融業等","保険業（保険媒介代理業，保険サービス業を含む)"],
        ["宿泊業","飲食店","持ち帰り・配達飲食サービス業"],
        ["洗濯・理容・美容・浴場業","その他の生活関連サービス業,娯楽業"],
        ["学校教育","その他の教育","学習支援業"],
        ["医療業","保健衛生","社会保険・社会福祉","介護事業"],
        ["郵便局","協同組合（他に分類されないもの）"],
        ["廃棄物処理業","自動車整備業","機械等修理業（別掲を除く）","職業紹介","労働者派遣業","その他の事業サービス業","政治・経済・文化団体","宗教","その他のサービス業","外国公務"],
        ["国家公務","地方公務"]];
        
        
        $occupations=[["管理的公務員","法人・団体役員","法人・団体管理職","その他の管理的職"]
        ,["営業（代理店含む）","渉外","MR","企画","広告宣伝","販売促進","PR","MD","マーケティング",
        "商品企画","広告宣伝","広報","人事","財務","総務"],
        ["一般事務","会計事務","経理事務","生産関連事務","営業販売事務","外務事務","運輸・郵便事務",
        "事務用機器操作","秘書","受付","購買","物流","事務アシスタント"],
        ["店長","販売","接客","売り場担当","小売、外食","ホールスタッフ","フロアスタッフ","調理スタッフ",
        "美容関連（理美容・エステ・マッサージ・美容部員）","エステティシャン","マッサージ","旅行手配員",
        "添乗員","ツアーコンダクター","宿泊施設","ホテル","フロント業務","ブライダル関連","運輸","物流サービス",
        "配送","倉庫関連警備","清掃","監視","保守","カスタマーサポート","コールセンター","ユーザーサポート",
        "オペレータ"],
        ["医師","歯科医師","獣医師","薬剤師","保健師","助産師","看護師","医療技術者","その他の保健医療",
        "社会福祉専門職"],
        ["小中高等学校教員","大学教員","幼稚園教員","高等専門学校教員","その他の教員"],
        ["ビジネスコンサルタント","専門コンサルタント","金融関係","不動産","プロパティマネジメント",
        "保険関係"],
        ["基礎研究","先行開発","要素技術開発","回路・システム設計","半導体設計、機械設計","金型設計",
        "品質管理","品質保証","製品評価","生産管理","生産技術","プロセス開発","セールスエンジニア",
        "アプリケーションエンジニア","FAE","サービスエンジニア","光学技術","その他技術職","CADオペレーター",
        "評価","実験","研究","特許","デバイス開発","プロセスエンジニア","プロセスインテグレーション",
        "整備士","テクニカルマーケティング","テクニカルライター"],
        ["素材","半導体素材","化成品","化粧品","食品","香料"],
        ["コンサルタント","アナリスト","プリセールス","エンジニア","プログラマ","システム開発","アーキテクト",
         "パッケージ導入","システム導入","ネットワーク設計・構築","通信インフラ設計・構築","運用","監視",
         "テクニカルサポート","保守","社内SE","ヘルプデスク"],
        ["著述家","記者","編集者","美術家","デザイナー","写真集家","映像撮影者","音楽家","舞台芸術家",
        "翻訳家","その他の専門職従事者"],
        ["自衛官","司法警察","消防官","その他の保安職"],
        ["農業","林業","漁業"],
        ["生産設備制御・監視従事者(金属製品）","生産設備制御・監視従事者(金属製品を除く）",
        "機会組立設備制御・監視、製品製造・加工処理(金属製品）","製品製造・加工処理(金属製品を除く）",
        "機械組立","機械整備・修理、製品検査(金属製品）",
        "製品検査(金属製品を除く）","機械検査、生産関連・生産類似業"],
        ["建設解体工事","建設（建設解体工事を除く）","電気工事","土木作業","採掘"],
        ["運搬","清掃","包装","その他の運搬・清掃・包装等の職"]];
        foreach($industries as $ind)
        {
            $industry= Industry::create(["name"=>$ind]);
            
        }
        foreach($occupations as $oc)
        {
            $occupation=Occupation::create(["name"=>$oc]);
        }
    }
}
